{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "dim_ordering": "th", "subsample": [1, 1], "input_dtype": "float32", "nb_col": 3, "b_constraint": null, "batch_input_shape": [null, 1, 48, 48], "init": "glorot_uniform", "activation": "linear", "nb_filter": 32, "bias": true, "W_constraint": null, "name": "convolution2d_1", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid", "dim_ordering": "th", "subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "nb_filter": 32, "bias": true, "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 3}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 128, "b_constraint": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "output_dim": 7, "b_constraint": null, "W_constraint": null, "input_dim": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}]}